#+TITLE: My Resume
#+AUTHOR: Anak Wannaphaschaiyong
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+SELECT_TAGS: export
#+OPTIONS: toc:nil title:nil H:1
#+LATEX_CLASS: altacv
#+LATEX_HEADER: \columnratio{0.6} % Set the left/right column width ratio to 6:4.
#+MACRO: cvevent \cvevent{$1}{$2}{$3}{$4}
#+MACRO: cvachievement \cvachievement{$1}{$2}{$3}{$4}
#+MACRO: cvtag \cvtag{$1}
#+MACRO: divider \par\divider

* Config :noexport:
** LaTeX Config
#+BEGIN_SRC emacs-lisp
(setq org-latex-packages-alist 'nil)
(setq org-latex-default-packages-alist
      '(("rm" "roboto"  t)
        ("defaultsans" "lato" t)
        ("" "paracol" t)
        ))
#+END_SRC

#+RESULTS:
| rm          | roboto  | t |
| defaultsans | lato    | t |
|             | paracol | t |

** Exporter Settings
** Macros
* CV Header
** Photo & Tagline
:PROPERTIES:
:ID:       93c7075b-d316-45b6-84d9-46f941349d9d
:END:
#+BEGIN_SRC latex
\name{Aidan Scannell}
% \photoR{2.8cm}{aidan_portrait.jpeg}
\tagline{PhD Researcher}
#+END_SRC
** Personal Info
#+BEGIN_EXPORT latex
\personalinfo{%
    \homepage{www.aidanscannell.com}
    \email{scannell.aidan@gmail.com}
    \phone{+44 787 558 3912}
    \location{Bristol, UK}
    \github{aidanscannell}
    \linkedin{aidan-scannell-82522789/}
}
\makecvheader
#+END_EXPORT
* CV Columns one
** Experience
*** PhD Researcher
*** Teaching Assistant
** Projects
*** AI
**** recommender system
*** application
**** chat
**** browser
**** bit torrent client
**** git
*** web design
**** API design
*** system design
**** server-client
***** load balancer
*** programming language implementation
**** language server for ANAK language
**** my own language called ANAK
**** parse ANAK language with tree-sitter.
**** DSL
*** text editor
**** implement text editor
*** database
**** implement database
*** system
**** kernel
**** debugger
**** docker
**** virtual machine
**** commandline tools
*** typesetting
**** paragraph layout in typesetting
*** algorithms collections
**** fuzzy search algorithm
*** blockchain
**** optimization
***** cross DEX arbitrage optimization
**** visualization
***** DUNE dashboard
**** token engineering
***** indexed protocol for ideas based on Zettlekasten.
*** Do not export this project
** Publication :noexport:
#+begin_export latex
\nocite{*}
\printbibliography[heading=pubtype,title={\printinfo{\faBook}{Books}},type=book]
\divider
\printbibliography[heading=pubtype,title={\printinfo{\faFile*[regular]}{Journal Articles}},type=article]
\divider
\printbibliography[heading=pubtype,title={\printinfo{\faUsers}{Conference Proceedings}},type=inproceedings]
#+end_export
** Volunteering
* CV Column two
** Skills
*** API: REST, OpenAPI, GraphQL, gRPC
*** IDE: Emacs, LSP, tree-sitter
*** Programming Language: Python, Common Lisp, ELisp, Rust, Go, TypeScript, JavaScript
*** Cloud stacks: Terraform, Docker, AWS, EC2, API Gateway, Lambda, Kinesis, S3, DynamoDB
*** Database: PostgreSQL, SQLite, MySQL
*** Blockchain: Solidity, Token engineering, DUNE, The Graph
*** Prompt Programming: GPT-3
** Education
** My Life Philosophy :noexport:
** Schievements
** Languages :noexport:
** Referees
* Backmatter
